from .utils import client


def test_tags():
    response = client.get("/tags")
    assert response.status_code == 200
    assert response.json() == {
        "tags": [
            "Моделирование",
            "Java",
            "Компиляторы",
            "3D графика",
            "Веб",
            "C",
            "Базы данных",
            "Статистика",
            "Нейронные сети",
            "Медицина",
            "Компьютерные сети",
            "Алгоритмы",
            "Высоконагрузенные системы",
            "Теория вычислений",
            "Android",
            "IOS",
            "Геоинформационные системы",
            "JavaScript",
            "Jave",
            "Теория графов",
            "C++",
            "NLP",
            "Программирование",
            "Машинное обучение",
            "Backend",
            "Frontend",
            "Исследовательский",
            "Теория языков программирования",
            "Python",
            "Глубокое обучение"
        ]
    }
